export type LoLTeamName =
  | 'T1'
  | '젠지'
  | '담원 기아'
  | 'DRX'
  | '리브 샌박'
  | 'KT'
  | '한화 생명'
  | '광동'
  | '농심'
  | '프레딧'
  | 'TBD'

export enum LoLTeam {
  'T1' = 'T1',
  '젠지' = '젠지',
  '담원 기아' = '담원 기아',
  'DRX' = 'DRX',
  '리브 샌박' = '리브 샌드박스',
  'KT' = 'kt 롤스터',
  '한화 생명' = '한화생명e스포츠',
  '광동' = '광동 프릭스',
  '농심' = '농심 레드포스',
  '프레딧' = '프레딧 브리온',
  'TBD' = 'TBD',
}

export enum MatchProgress {
  '예정' = '예정',
  '1세트' = '1세트',
  '2세트' = '2세트',
  '3세트' = '3세트',
  '4세트' = '4세트',
  '5세트' = '5세트',
  '종료' = '종료',
  '취소' = '취소',
  '경기취소' = '경기취소',
}
